Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པ་ཐོག་མ་མངོན་པར་སངས་རྒྱས་ནས། ཞག་བདུན་ལོན་ཏེ། སྙིང་པོ་བྱང་ཆུབ་ལ་བཞུགས་པ་དེ་བསྟནཏོ།
en: She revealed the tathāgata residing at the bodhimaṇḍa seven days after he had attained buddhahood.

source: །དེ་ནས་ཁོ་མོ་ཕ་མ་དང་གཉེན་བཤེས་ཀྱི་ཚོགས་ཆེན་པོ་དང་འགྲོགས་ཏེ། མཚན་མོའི་ལྷ་མོ་ཤིན་ཏུ་རྣམ་པར་དག་པའི་ཟླ་བའི་འོད་སྔོན་དུ་བདར་ནས།
en: “Then, accompanied by my parents and a great crowd of my family, and preceded by Viśuddha­netrābhā, the goddess of the night, I went into the presence of that tathāgata.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྤྱན་སྔར་ཕྱིན་ཏོ། །དེ་ནས་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་ལ་མཆོད་པ་རྒྱ་ཆེན་པོ་བྱས་ཏེ། དེ་བཞིན་གཤེགས་པ་དེའི་ཞལ་མཐོང་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་འགྲོ་བ་འདུལ་ཞིང་སངས་རྒྱས་མཐོང་བར་བྱེད་པ་ཞེས་བྱ་བ་དང་། ཏིང་ངེ་འཛིན་དུས་གསུམ་གྱི་དབྱིངས་ཡེ་ཤེས་ཀྱིས་སྣང་བའི་དཀྱིལ་འཁོར་ཅེས་བྱ་བ་ཡང་ཐོབ་པར་གྱུར་ཏོ།
en: I then made vast offerings to the Tathāgata, and as soon as I saw the Tathāgata’s face, I attained the samādhi called guiding beings and seeing the Buddha’s face and the samādhi called the domain illuminated by the wisdom of the range of the three times

source: །དེ་ཐོབ་པས་ཀྱང་ཁོ་མོས་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་པོ་དེ་དག་ཀྱང་རྗེས་སུ་དྲན་པར་གྱུར་ཏོ།
en: Through attaining them I remembered as many kalpas as there are atoms in Sumeru

source: །ཁོ་མོའི་བྱང་ཆུབ་ཀྱི་སེམས་དེ་ཡང་མངོན་དུ་གྱུར་ཏེ།
en: My aspiration to enlightenment manifested.

source: དེ་ལྟར་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དེ་ལས་ཆོས་བསྟན་པ་ཐོས་ཏེ། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་ཡང་ཐོབ་པར་གྱུར་ཏོ།
en: In that way, I heard the Dharma from that tathāgata, and I attained the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings

source: །དེ་ཐོབ་པས་ཀྱང་འཇིག་རྟེན་གྱི་ཁམས་སངས་རྒྱས་ཀྱི་ཞིང་བཅུའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་ཞིང་། བདག་ཉིད་ཀྱང་དེ་དག་ཐམས་ཅད་ཀྱི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པར་ཤེས་སོ།
en: Through attaining that, I pervaded with my body as many worlds as there are atoms in ten buddha realms, and there appeared to my sight all the buddhas who were present in those worlds, and I knew that I was present at the feet of all of them.

source: །འཇིག་རྟེན་གྱི་ཁམས་དེ་དག་ཏུ་སེམས་ཅན་ཇི་སྙེད་ཅིག་སྐྱེས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ། དེ་དག་གི་སྒྲ་སྐད་རྣམ་པ་ཐ་དད་པའི་བརྡ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: All of the beings who had been born in those world realms appeared to my sight, and I knew all the symbols of their different languages.

source: །སེམས་དང་བསམ་པ་དང་། དབང་པོ་དང་མོས་པ་ཡང་རབ་ཏུ་ཤེས་སོ།
en: I knew their minds, thoughts, faculties, and aspirations.

source: །སྔོན་གྱི་མཐའི་དགེ་བའི་བཤེས་གཉེན་རྣམས་ཀྱི་དྲུང་དུ་ཡོངས་སུ་སྨིན་པར་གྱུར་པའང་རབ་ཏུ་ཤེས་སོ།
en: I knew the past kalyāṇamitras in whose presence they were ripened.

source: །དེ་དག་ལ་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཚིམ་པར་འགྱུར་བའི་ལུས་ཀྱང་ཡོངས་སུ་སྟོན་ཏོ།
en: I manifested to them the bodies that satisfied them according to their aspirations.

source: །ཁོ་མོའི་རྣམ་པར་ཐར་པ་དེ་ཡང་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་རྣམ་པར་འཕེལ་ཏེ།
en: That liberation of mine increased with each instant of the mind.

source: རྣམ་པར་ཐར་པའི་སེམས་དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ།
en: Through the instant of mind that followed that instant of mind of liberation, my body pervaded as many buddha realms as there are atoms in a hundred world realms.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ།
en: Through the next instant of mind, my body pervaded as many buddha realms as there are atoms in a thousand world realms.

source: །དེའི་འོག་མའི་སེམས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྒྱ་ཕྲག་སྟོང་གི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ། །དེ་བཞིན་དུ་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ཞིང་སངས་རྒྱས་ཀྱི་ཞིང་འཇིག་རྟེན་གྱི་ཁམས་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་བར་དག་ཀྱང་ལུས་ཀྱིས་རྒྱས་པར་འགེངས་སོ།
en: Through the next instant of mind, my body pervaded as many buddha realms as there are atoms in a hundred thousand world realms, and so on, up to my body pervading, in each instant of mind, as many buddha realms as there are atoms in an anabhilāpyānabhilāpya of world realms.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་དག་ན་དེ་བཞིན་གཤེགས་པ་ཇི་སྙེད་ཅིག་བཞུགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ། བདག་ཉིད་ཀྱང་དེ་དག་གི་ཞབས་ཀྱི་དྲུང་ན་འདུག་པར་ཤེས་སོ།
en: There appeared to my sight all the buddhas that were present in those worlds, and I knew that I was present at the feet of all of them.

source: །སངས་རྒྱས་བཅོམ་ལྡན་འདས་དེ་དག་གིས་ཆོས་བསྟན་པ་དེ་དག་ཐམས་ཅད་ཀྱང་ལེན་ཏོ།
en: I obtained all the Dharma that was taught by those buddha bhagavats.

source: །འཛིན་ཏོ། །ཡོངས་སུ་འཛིན་ཏོ། །ཉེ་བར་འཛིན་ཏོ།
en: I possessed it, kept it, preserved it.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སྔོན་གྱི་ཚུལ་རྒྱ་མཚོ་དང་། སྨོན་ལམ་རྒྱ་མཚོ་ལ་ཡང་འཇུག་གོ །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རང་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བྱ་བའི་ཕྱིར།
en: I comprehended the past ocean of ways and ocean of prayers of those tathāgatas. All those buddha realms purified by those tathāgatas were created in order to purify their own buddha realms.

source: མངོན་པར་སྒྲུབ་བོ། །སེམས་ཅན་ཇི་སྙེད་ཅིག་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་དེ་དག་དུ་སྐྱེས་པར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ཀྱང་། ཁོ་མོའི་མིག་ལམ་དུ་སྣང་སྟེ།
en: All of the beings who had been born in those world realms appeared to my sight.

source: སེམས་ཅན་དེ་དག་གི་བསམ་པ་དང་དབང་པོ་དང་མོས་པའི་བྱེ་བྲག་ཇི་སྙེད་པ་དེ་སྙེད་ཀྱི་བྱེ་བྲག་དུ་དེ་དག་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཕྱིར་ལུས་བྱིན་གྱིས་རློབ་སྟེ།
en: I blessed my body in order to ripen and guide all of their different minds, thoughts, faculties, and aspirations.

source: དེ་ལྟར་ཁོ་མོའི་རྣམ་པར་ཐར་པ་དེ་ནི་སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཡང་ཆོས་ཀྱི་དབྱིངས་འབྱམ་ཀླས་པ་རྒྱས་པར་འགེངས་པའི་ཚུལ་གྱིས་རྣམ་པར་འཕེལ་ལོ།
en: “Thus, the way in which my liberation pervaded the entire extent of the realm of phenomena increased with each instant of mind.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་འདི་ཤེས་པར་ཟད་ན།
en: “Noble one, I know only this bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings

source: ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་མཐའ་དང་དབུས་མེད་པའི་བྱང་ཆུབ་སེམས་དཔའི་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱིས་བྱུང་བ།
en: How could I know the conduct or describe the qualities of bodhisattvas who have arisen from the completely good bodhisattva conduct and prayers that have no middle or edge;

source: ཆོས་ཀྱི་དབྱིངས་རྒྱ་མཚོའི་ཚུལ་འབྱམ་ཀླས་པར་འདལ་བ་ལ་འཇུག་པར་དབང་སྒྱུར་བ།
en: who have the power to enter the entire extent of the ways of the ocean of the realm of phenomena;

source: བྱང་ཆུབ་སེམས་དཔས་ཡང་དག་པར་བསྒྲུབ་པའི་ཏིང་ངེ་འཛིན་ཡེ་ཤེས་རྡོ་རྗེའི་དཔལ་གྱིས་རྣམ་པར་རྩེ་བ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ། དེ་བཞིན་གཤེགས་པའི་རིགས་ཐམས་ཅད་ཡང་དག་པར་གཟུང་བ་ལ་སྨོན་ལམ་ཆེན་པོས་བྱུང་བ།
en: who play in the samādhi called the glorious vajra of wisdom , which is attained by bodhisattvas who have arisen from the great prayers to be in the care of all the families of tathāgatas in all world realms;

source: འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པ་ཐམས་ཅད་སེམས་ཀྱི་སྐད་ཅིག་གཅིག་གིས་ཡོངས་སུ་དག་པར་བྱ་བའི་བསོད་ནམས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ཡོངས་སུ་གྲུབ་པ།
en: who have accomplished a great ocean of merit that purified in an instant of mind the vast extent of world realms;

source: སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བའི་ཡེ་ཤེས་ལ་དབང་བསྒྱུར་བའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སྒྲིབ་པའི་མུན་པ་ཐམས་ཅད་རྣམ་པར་སེལ་བའི་ཡེ་ཤེས་ཀྱི་ཉི་མའི་མིག་དང་ལྡན་པ།
en: who in each instant of mind ripen all the realms of beings; who have the eyes of the sun of wisdom that dispels all the darkness of the obscurations of all beings in all the world realms that are under the power of their guiding wisdom;

source: སེམས་ཅན་གྱི་ཁམས་ཐམས་ཅད་ལ་ཐེག་པ་ཆེན་པོ་རྣམ་པར་དམིགས་པར་བྱ་བའི་མཐུ་དང་ལྡན་པ།
en: who have the power to communicate the Mahāyāna to all the realms of beings;

source: འགྲོ་བ་ཐམས་ཅད་ཀྱི་ཐེ་ཙོམ་དང་། ནེམ་ནུར་དང་། ཡིད་གཉིས་ཀྱི་རབ་རིབ་རྣམ་པར་སེལ་བའི་བློ་གྲོས་ཀྱི་ཟླ་བ་དང་ལྡན་པ།
en: who possess the moon of intelligence that dispels the darkness of doubt, uncertainty, and equivocation within all beings;

source: སྲིད་པའི་རྒྱ་མཚོ་ཐམས་ཅད་ལ་མངོན་པར་ཆགས་པ་ལས་གྱེན་དུ་བསྐྱོད་པའི་སྒྲ་དབྱངས་ཀྱི་དཀྱིལ་འཁོར་རྣམ་པར་དག་པ།
en: who have the pure domain of speech that lifts beings from attachment to the entire ocean of existence;

source: ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱིས་རྡུལ་གྱི་ཆ་ཤས་ལ་རྣམ་པར་འཕྲུལ་བ། ཡོངས་སུ་སྟོན་པ་ལ་དབང་བསྒྱུར་བ།
en: who have the power to manifest emanations in the atoms throughout the entire realm of phenomena;

source: དུས་གསུམ་གྱི་དབྱིངས་ཀྱི་དཀྱིལ་འཁོར་ལ་ཡེ་ཤེས་དབྱེར་མེད་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ། ཡོན་ཏན་བརྗོད་པའམ།
en: and who are inseparable from the domain of the knowledge of the entire range of the three times?

source: སྤྱོད་ཡུལ་ལ་འཇུག་པའམ། རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བ་ཡོངས་སུ་བསྟན་པར་ནུས་རེ་སྐན།
en: “Depart, noble one.

source: །སོང་རིགས་ཀྱི་བུ་ཡུལ་མ་ག་དྷ་འདི་ཉིད་ཀྱི་སྙིང་པོ་བྱང་ཆུབ་ལ་ཁོ་མོ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་བསྐྱེད་པ། ཡང་དང་ཡང་བསྐུལ་བསྐུལ་བའི་མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཅེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: At the bodhimaṇḍa in this land of Magadha there is the goddess of the night called Samanta­gambhīra­śrī­vimala­prabhā, whom I have inspired again and again to develop the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་གྱིས།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: Then Sudhana, the head merchant’s son, praised the night goddess Vāsantī with these verses:

source: །ཁྱོད་སྐུ་ཤིན་ཏུ་རྣམ་པར་དག་པ་མཐོང་།
en: “I see the purity of your body

source: །མཚན་གྱིས་རྣམ་བརྒྱན་རི་བོ་ཇི་བཞིན་དུ།
en: Adorned by signs, like Meru,

source: །འཇིག་རྟེན་ཀུན་ལས་མངོན་འཕགས་འཇིག་རྟེན་དུ།
en: Superior to all worlds; within the world

source: །ཕུན་སུམ་ཚོགས་སྐུ་འཇམ་དཔལ་བཞིན་དུ་མཛེས།
en: You have a perfect body as beautiful as Mañjuśrī’s.

source: །ཁྱོད་ཀྱི་ཆོས་སྐུ་ཤིན་ཏུ་རྣམ་དག་སྟེ།
en: “Your Dharma body is completely pure,

source: །དུས་གསུམ་ཀུན་ཏུ་མཉམ་ཞིང་རྣམ་མི་རྟོག །དེར་ནི་འཇིག་རྟེན་མ་ལུས་ཀུན་འདུས་ཏེ།
en: The same in all three times, without conceptualization. Every world without exception is contained within it

source: །འབྱུང་ཞིང་རྣམ་པར་འཇིག་ཀྱང་ཆགས་མི་མངའ།
en: Without creation, destruction, or abiding. “I see the image of your body dispersed

source: །ལམ་རྒྱུད་འབྱམ་ཀླས་ཐམས་ཅད་ཀུན་ཏུ་ཡང་།
en: Throughout the whole extent of existences,

source: །ཁྱོད་ཀྱི་སྐུ་ནི་གཟུགས་བརྙན་རྣམ་པར་ཕྱེ།
en: And I see within the pores of your body

source: །སྐར་ཆེན་ཟླ་སྐར་རྒྱུ་སྐར་ཚོགས་ལ་ཇི་བཞིན་དུ། །སྤུ་རྩེ་ཀུན་ལའང་ཁྱོད་ནི་བདག་གིས་མཐོང་།
en: The constellations of stars with the moon and planets.

source: །ཁྱོད་ཀྱི་ཐུགས་ཡངས་ཤིན་ཏུ་རྣམ་དག་སྟེ།
en: “Your mind also is completely pure,

source: །ཕྱོགས་རྣམས་ཀུན་ཏུ་ནམ་མཁའི་དབྱིངས་སུ་རྒྱས།
en: Pervading the realm of space in all directions.

source: །དེར་ནི་མི་མཆོག་ཀུན་ཀྱང་ཡོངས་སུ་འདུ།
en: Even the supreme among humans are all included within it.

source: །ཁྱོད་ལ་ཡེ་ཤེས་མི་རྟོག་དམ་པ་མངའ།
en: You possess the supreme wisdom free of concepts.

source: །ཞིང་གི་རྡུལ་སྙེད་རྣམ་པ་སྣ་ཚོགས་སྤྲིན།
en: “Multicolored clouds as numerous as the atoms in a realm

source: །ཁྱོད་ཀྱི་སྤུ་རྩེ་ཀུན་ནས་མངོན་འཐོན་ཅིང་། རྒྱན་མངས་སྣ་ཚོགས་ཆར་པ་མངོན་འབེབས་ཤིང་།
en: Arise out of all the pores of your body,

source: །ཕྱོགས་བཅུའི་སངས་རྒྱས་ཞབས་དྲུང་རྒྱས་པར་འགེངས།
en: Spread to the buddhas in the ten directions, And send down a rainfall of all adornments.

source: །འགྲོ་བ་ཀུན་སྙེད་ལུས་རྣམས་མཐའ་ཡས་བ།
en: “The endless number of the bodies as numerous as beings

source: །ཁྱོད་ཀྱི་སྤུ་རྩེ་ཀུན་ནས་མངོན་འཐོན་ཅིང་།
en: Arise out of the pores of your body.

source: །ཕྱོགས་བཅུའི་འཇིག་རྟེན་རྒྱས་པར་ཡོངས་བཀང་ནས།
en: They pervade and fill the worlds in the ten directions

source: །སྣ་ཚོགས་ཐབས་ཀྱིས་སེམས་ཅན་རྣམ་པར་སྤྱོད།
en: And purify beings through various methods.

source: །སྤུ་རྩེ་ཀུན་ལ་བསམ་ཡས་ཞིང་གི་རྣམས།
en: “I see an inconceivable number of realms

source: །སྣ་ཚོགས་རྒྱན་ལྡན་རྣམ་པ་ཐ་དད་མཐོང་།
en: With various different displays in all your pores. They appear in accordance with all the aspirations

source: །ལམ་རྒྱུད་སེམས་ཅན་ཁྱོད་ཀྱིས་རྣམ་སྦྱངས་པ། །ཇི་སྙེད་དེ་དག་བསམས་བཞིན་ཀུན་ཀྱང་བྱུང་།
en: Of those you purify in the various existences of beings.

source: །གང་ཞིག་ཁྱོད་ཀྱི་མཚན་ཐོས་དགའ་གྱུར་པ།
en: “Whoever rejoices on hearing your name

source: །དེ་དག་ཐོབ་བྱ་ལེགས་ཐོབ་ལེགས་པར་འཚོ།
en: Will easily attain their goals and live well.

source: །སེམས་ཅན་གང་གིས་ཁྱོད་ཀྱི་སྐུ་མཐོང་བ།
en: Whatever being sees your body

source: །བྱང་ཆུབ་ལམ་ལ་མངོན་དུ་བལྟས་པར་འགྱུར།
en: Will be facing the path to enlightenment. “Merely seeing you causes the kleśas to cease

source: །དེ་ལྟར་ཐོས་ནས་རབ་ཏུ་སེམས་དགའ་ལ། །མཐོང་བ་ཙམ་གྱིས་ཉོན་མོངས་ཞི་མཛད་པས།
en: In one who rejoices on hearing your name.

source: །བསྐལ་པ་བསམ་ཡས་ངན་སོང་གནས་ཀྱང་ཆུང་།
en: I would endure countless kalpas in the lower realms

source: །ཁྱོད་ཀྱི་ཞལ་ལྟའི་དོན་དུ་མོས་པར་བགྱི།
en: So that I could see your face.

source: །ཞིང་རྣམས་སྟོང་གི་རྡུལ་སྙེད་ལུས་བྱས་ཏེ།
en: “If I were to create as many bodies as there are atoms in a thousand realms,

source: །དེ་སྙེད་བསྐལ་པ་བརྒྱུད་དེ་ཁྱོད་འདྲ་བའི།
en: And for the duration of that same number of kalpas

source: །སྤུ་རྩེ་གཅིག་གི་ཡོན་ཏན་ལེགས་བརྗོད་ཀྱང་།
en: They were to describe the qualities of just one of your pores,

source: །ལེགས་པའི་མཐར་ཕྱིན་ནམ་དུའང་མི་འགྱུར་རོ།
en: They would never be able to reach the end of that description.”

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ཚིགས་སུ་བཅད་པ་དེ་དག་གིས་མངོན་པར་བསྟོད་ནས། །མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། དགེ་བའི་བཤེས་གཉེན་ལ་བསྙེན་བཀུར་བྱ་བས། མ་ངོམས་བཞིན་དུ་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་དྲུང་ནས་སོང་ངོ་།། །།སངས་རྒྱས་རྨད་གཅད་ཅེས་བྱ་བ་ཤིན་ཏུ་རྒྱས་པ་ཆེན་པོའི་མདོ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the night goddess Vāsantī, circumambulated the night goddess Vāsantī many hundreds of thousands of times, keeping her to his right, and, looking back again and again with unfulfilled longing, departed from the night goddess Vāsantī.

source: བམ་པོ་དྲུག་པ།
en: Samanta­gambhīra­śrī­vimala­prabhā

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ཐོག་མ་བྱང་ཆུབ་ཏུ་ཞུགས་པའི་བྱང་ཆུབ་ཀྱི་སེམས་ཀྱི་དཀྱིལ་འཁོར་ཡོངས་སུ་དག་པ་ནི་ཁོང་དུ་ཆུད་པར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་སྙིང་པོ་ཡང་དག་པར་འབྱུང་བ་ལ་ནི་རྗེས་སུ་དཔྱོད། བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་རྒྱ་མཚོ་ལ་ནི་ཡོངས་སུ་འཇུག །བྱང་ཆུབ་སེམས་དཔའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་ལམ་ནི་ཡོངས་སུ་སྦྱོང་། བྱང་ཆུབ་སེམས་དཔའི་སའི་དཀྱིལ་འཁོར་ནི་ཡོངས་སུ་གནོན། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པའི་དཀྱིལ་འཁོར་ནི་རྒྱ་ཆེར་བྱེད། བྱང་ཆུབ་སེམས་དཔའི་འབྱུང་བ་རྒྱ་མཚོ་ནི་རྗེས་སུ་འབྲང་། ཐམས་ཅད་མཁྱེན་པའི་སྣང་བ་ཆེན་པོ་རྒྱ་མཚོ་ལ་ནི་རྣམ་པར་ལྟ། འགྲོ་བ་ཐམས་ཅད་ཡོངས་སུ་བསྐྱབ་པ་ལ་གཞོལ་པའི་བྱང་ཆུབ་སེམས་དཔའི་སྙིང་རྗེ་ཆེན་པོའི་སྤྲིན་ནི་རྒྱ་ཆེར་བྱེད། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་། སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ནི་ཞིང་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐར་བྱིན་གྱིས་བརླབ་པས་མངོན་པར་སྒྲུབ་ཅིང་། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་གང་ན་བ་དེར་སོང་སྟེ། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Then Sudhana, the head merchant’s son, contemplating the night goddess Vāsantī’s first entry into the pure domain of aspiration to enlightenment, analyzing the arising of the essence of a bodhisattva, comprehending the ocean of bodhisattva prayer, purifying the bodhisattva path of perfections, overcoming the domain of the bodhisattva levels, augmenting the domain of bodhisattva conduct, following an ocean of the setting-forth of bodhisattvas, looking at the ocean of the great illumination of omniscience, increasing the bodhisattva clouds of great compassion intent on saving all beings, and attaining the blessing of the completely good bodhisattva conduct and prayer of the night goddess Vāsantī that extends to the limits of all realms, went to the location of the night goddess Samanta­gambhīra­śrī­vimala­prabhā.

source: མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ལ། ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། མཚན་མོའི་ལྷ་མོ་ཀུན་ཏུ་ཟབ་པའི་དཔལ་དྲི་མ་མེད་པའི་འོད་ཀྱི་མདུན་དུ་འདུག་སྟེ། ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་བདག་གིས་བླ་ན་མེད་བ་ཡང་དག་པར་རྫོགས་པའི་བྱང་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ན།
en: Having reached her, he bowed his head to the feet of the night goddess Samanta­gambhīra­śrī­vimala­prabhā, circumambulated the night goddess Samanta­gambhīra­śrī­vimala­prabhā many hundreds of thousands of times, keeping her to his right, and then stood before her and, with palms together, said, “Āryā, I have developed the aspiration for the highest, complete enlightenment.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་སྤྱོད་པ་དང་། ཇི་ལྟར་འབྱུང་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བགྱི་བ་མ་འཚལ་ཏོ།
en: However, I do not know how a bodhisattva practices on the level of a bodhisattva, how a bodhisattva sets forth, how a bodhisattva accomplishes.”

source: །སྨྲས་པ་རིགས་ཀྱི་བུ་ཁྱོད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ས་ལ་སྤྱོད་པ་དང་། འབྱུང་བ་དང་ཡོངས་སུ་འགྲུབ་པ་འདྲི་བ་ལེགས་སོ། །ལེགས་སོ།
en: She answered, “Noble one, it is excellent, excellent, that you have developed the aspiration for the highest, complete enlightenment and that you ask how to practice, set forth, and accomplish on the level of a bodhisattva.

source: །རིགས་ཀྱི་བུ་ཆོས་བཅུ་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་གྲུབ་པ་ཡིན་ཏེ།
en: It is through possessing ten qualities that bodhisattvas accomplish bodhisattva conduct.

source: བཅུ་གང་ཞེ་ན། འདི་ལྟ་སྟེ།
en: What are these ten? They are (1) the pure attainment of the samādhi that directly perceives all the tathāgatas;

source: དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མངོན་དུ་གྱུར་པར་མཐོང་བའི་ཏིང་ངེ་འཛིན་ཐོབ་པ་རྣམ་པར་དག་པ་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྐུ་མཚན་སྣ་ཚོགས་དང་ལྡན་པ་རྣམ་པར་བལྟ་བའི་མིག་རྣམ་པར་དག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཁ་དོག་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་རྣམ་པར་དམྱིགས་པར་བྱ་བ་ལ་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་སྣང་བའི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་ཚད་མེད་པ་ལ་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་ཀྱི་ཚད་ཀྱིས་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་ནས་འོད་ཟེར་རྒྱ་མཚོ་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པ་དང་། སེམས་ཅན་སྣ་ཚོགས་ཀྱི་དོན་དུ་བཀྱེ་བ་ལ་འཇུག་པ་དང་། བ་སྤུའི་བུ་ག་རེ་རེ་ནས་འོད་འཕྲོ་བ་རིན་པོ་ཆེ་ཐམས་ཅད་ཀྱི་ཁ་དོག་དུ་འདུག་པ་རྒྱ་མཚོ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་སངས་རྒྱས་ཀྱིས་སྤྲུལ་པ་རྒྱ་མཚོས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་བཀང་ཞིང་སེམས་ཅན་འདུལ་བའི་བྱིན་གྱི་རླབས་ལ་འཇུག་པ་དང་། དེ་བཞིན་གཤེགས་པའི་གསུང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དབྱངས་ཀྱི་ཡན་ལག་དང་ལྡན་པས།
en: the pure eyesight that sees the bodies, endowed with the various signs, of all the buddhas; (3) realizing the perception of the centerless, endless ocean of the colors of the tathāgatas; (4) comprehending the extent of the entire realm of phenomena and the measureless ocean of the domain of the radiant qualities of the buddhas; (5) comprehending the ocean of light rays from the pores of all the tathāgatas that are as numerous as all beings and radiate to benefit the variety of beings; (6) seeing an ocean of light rays, the colors of all jewels, coming from each pore;

source: དུས་གསུམ་དུ་བྱུང་བའི་ཆོས་ཀྱི་འཁོར་ལོའི་སྒྲ་སྒྲོག་པས། མདོ་སྡེ་ཐམས་ཅད་ཀྱི་སྤྲིན་གྱི་འབྲུག་སྒྲ་འབྱིན་པའི་དཀྱིལ་འཁོར་ལ་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་མཚན་རྒྱ་མཚོ་མཐའ་དང་དབུས་མེད་པ་ལ་འཇུག་པ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་འདུལ་བ་ལ་འཇུག་པ་སྟེ།
en: comprehending the ocean of emanations of the buddhas that in each instant of mind pervade the entire realm of phenomena and give the blessing that guides beings; (8) comprehending the domain of thunder from the clouds of all the sūtras through possessing the speech of the tathāgatas, which has the aspects of the voices of all beings, and the sound of the wheel of the Dharma appearing in the three times; (9) comprehending the centerless and endless ocean of the signs of the buddhas; and (10) comprehending the guiding of beings through the manifestation of the inconceivable emanations of the buddhas.

source: རིགས་ཀྱི་བུ་ཆོས་བཅུ་པོ་འདི་དག་དང་ལྡན་པའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་ཡོངས་སུ་གྲུབ་པ་ཡིན་ནོ། །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ།
en: “Noble one, the bodhisattvas who possess these ten qualities accomplish bodhisattva conduct.

source: བསམ་གཏན་ཞི་བའི་བདེ་བས་ཀུན་ཏུ་རྣམ་པར་གནོན་པ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called complete subjugation through the bliss of the peace of śamatha

source: རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་དེའི་མཐུས། དུས་གསུམ་དུ་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱང་མཐོང་སྟེ།
en: “Noble one, through its power I see all the tathāgatas who are in the three times, and I perceive the completely pure buddha realms of those tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པ་ལའང་འཇུག་གོ །འཁོར་གྱི་དཀྱིལ་འཁོར་རྒྱ་མཚོ་དང་། ཏིང་ངེ་འཛིན་མཐའ་དང་དབུས་མེད་པའི་རྣམ་པར་འཕྲུལ་བ་རྒྱ་མཚོ་དང་། སྔོན་གྱི་ཚུལ་རྒྱ་མཚོ་དང་། མཚན་རྒྱ་མཚོ་ལ་འང་འཇུག་གོ །དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཆོས་ཀྱི་འཁོར་ལོ་རབ་ཏུ་འཁོར་བ་རྣམ་པ་ཐ་དད་པ་ལའང་འཇུག་གོ །དེ་བཞིན་གཤེགས་པའི་སྐུ་ཚེའི་ཚད་སྣ་ཚོགས་དང་། དབྱངས་ཀྱི་ཡན་ལག་རྣམ་པ་ཐ་དད་པ་དང་། དེ་བཞིན་གཤེགས་པ་དེ་དག་གི་ཆོས་ཀྱི་དབྱིངས་མཐའ་དང་དབུས་མེད་པའི་སྐུའང་འཇུག་སྟེ།
en: I perceive the ocean of their assemblies of followers, the ocean of their centerless and endless miraculous manifestations from samādhi, the ocean of their past practices, and the ocean of their names. I also perceive each separate turning of the wheel of the Dharma by those tathāgatas. I perceive the various lifespans and different aspects of voice of those tathāgatas and the bodies of those tathāgatas who have the nature of the centerless and limitless realm of phenomena.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ལ་དངོས་པོར་མངོན་པར་ཞེན་པའང་མེད་དོ།
en: “Those tathāgatas are not attached to things as being existent.

source: འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ་བཞུད་པ་འགགས་པའི་ཕྱིར། དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བཞུད་པ་མེད་པའོ།
en: Those tathāgatas do not go because of their cessation of going through all worlds.

source: །རང་བཞིན་གྱིས་བྱུང་བ་མེད་པས་ན།
en: Those tathāgatas do not arrive because their nature has no arising.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བྱོན་པ་མེད་པའོ། །མི་སྐྱེ་བའི་ཆོས་ཉིད་དང་། མཉམ་པའི་སྐུ་མངའ་བའི་ཕྱིར།
en: Those tathāgatas are unborn because they have a body that is the same as the birthless true nature.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མ་སྐྱེས་པའོ། །མི་སྐྱེ་བའི་མཚན་ཉིད་དང་ལྡན་པའི་ཕྱིར།
en: Those tathāgatas are unceasing because they have the characteristic of birthlessness.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མ་འགགས་པའོ། །སྒྱུ་མའི་རྣམ་པ་ལྟ་བུར་མཐོང་ཞིང་རྣམ་པར་དམིགས་པའི་ཕྱིར།
en: Those tathāgatas are not true because of perceiving and seeing phenomena to be illusions.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་མི་བདེན་པ་མ་ཡིན་པའོ། །འགྲོ་བ་ཐམས་ཅད་ཀྱི་དོན་དུ་བྱུང་བའི་ཕྱིར།
en: Those tathāgatas are not false because there arises benefit for all beings.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ནི་བརྫུན་པ་མ་ཡིན་པའོ། །ཤི་འཕོ་དང་སྐྱེ་བ་ལས་རྣམ་པར་འདས་པའི་ཕྱིར།
en: Those tathāgatas do not pass away because they have transcended death, passing, and birth.
